app/controllers/authentication_controller.rb

  def authenticate
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ksd123@gmail.com"], ["LIMIT", 1]]