app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "nick2"], ["email", "nick2@nick.com"], ["password", "nick12345"], ["created_at", "2020-09-17 17:22:58.954905"], ["updated_at", "2020-09-17 17:22:58.954905"]]

  def signin
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "nick2@nick.com"], ["LIMIT", 1]]