app/controllers/waters_controller.rb

  def create
    water = @current_user.waters.build(amount: params[:amount], total: params[:total])
    if water.save
---
INSERT INTO "waters" ("amount", "total", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 12], ["total", 12], ["created_at", "2020-10-09 10:25:30.704174"], ["updated_at", "2020-10-09 10:25:30.704174"], ["user_id", 17]]

  def set_water
    @set_water ||= Water.find(params[:id])
---
SELECT "waters".* FROM "waters" WHERE "waters"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]